W5D5/music_app/app/controllers/bands_controller.rb

    def index
        @bands = Band.all
---
SELECT  "bands".* FROM "bands" WHERE (turtle band) LIMIT $1  [["LIMIT", 1]]

    def show
        @band = Band.find_by(name: params[:id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."name" = $1 LIMIT $2  [["name", "turtle band"], ["LIMIT", 1]]

    def create
        @band = Band.new(band_params) #models take in a hash

        if @band.save
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "band"], ["created_at", "2019-05-19 00:05:14.904195"], ["updated_at", "2019-05-19 00:05:14.904195"]]