W5D5/music_app/app/controllers/users_controller.rb

INSERT INTO "users" ("email_address", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create

        @user = User.new(user_params)#[:email_address], user_params[:password])

        if @user.save