W5D5/music_app/app/models/user.rb

    def self.find_by_credentials(email, password)

        user = User.find_by(email_address: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email_address" = $1 LIMIT $2  [["email_address", "capitalb@live.com"], ["LIMIT", 1]]